RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_ac.h
/***************************************************************************//**
* \file cy_hppass_ac.h
* \version 1.30.1
*
* Header file for the Autonomous Controller (AC) subsystem of
* the High Performance Programmable Analog Sub-System (HPPASS).
*
********************************************************************************
* \copyright
* Copyright (c) (2024), Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.
* SPDX-License-Identifier: Apache-2.0
*
* Licensed under the Apache License, Version 2.0 (the "License");
* you may not use this file except in compliance with the License.
* You may obtain a copy of the License at
*
*     http://www.apache.org/licenses/LICENSE-2.0
*
* Unless required by applicable law or agreed to in writing, software
* distributed under the License is distributed on an "AS IS" BASIS,
* WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
* See the License for the specific language governing permissions and
* limitations under the License.
*******************************************************************************/

/**
* \addtogroup group_hppass_ac
* \{
* This driver provides API functions to configure, manage and interact with the Autonomous Controller (AC)
* subsystem within High Performance Programmable Analog Sub-System (HPPASS).
*
* The autonomous controller is a programmable finite-state machine (FSM) sequencer that works from a 16-entry state
* transition table, to transition appropriately through various pre-defined states, based on timer, counter, and/or
* events.
* The AC provides hardware control without the need for CPU or external intervention. <br>
* The internal structure and external HW interface of the AC is shown at the picture below.
*
* \image html hppass_ac_structure.png width=30%
*
* Autonomous controller can perform the following functions:
* - Enable/disable SAR ADC and/or CSG, provide a BLOCK_READY status to the firmware
* - Process input hardware/firmware triggers to execute programmed actions
* - Trigger any of the internal or connected blocks
* - Implement hardware delays/counters
* - Perform periodic actions (e.g., triggering) in a timed loop
* - Receive conditions from the connected blocks and acting on those events
* - Generate an AC-based interrupt to the CPU
* - Digital output to as many as five GPIOs
*
* The AC has a standard interface to each sub-block of HPPASS, the interface consists of: Enable, Trigger, and
* Conditions signals groups.
*
* Refer to the Technical Reference Manual for detailed information.
*
* To configure the AC, the driver uses a configuration structure of type \ref cy_stc_hppass_ac_t that must be predefined.
* In turn, this structure holds the non-NULL pointer to the State Transition Table (STT) array of type \ref cy_stc_hppass_ac_stt_t.
* The configuration structure also holds a specialized startup configuration array of type \ref cy_stc_hppass_startup_t.<br>
* This array defines the parameters of the AC HW startup.
*
* \section group_hppass_ac_stt State Transition Table
* The AC can implement a single threaded programming sequence using a simple format.
* The AC program is stored in a RAM table called a STT, which consists of 16 States (or programming instructions) of type cy_stc_hppass_ac_stt_t.
* These programming instructions can form one or more programs, called by FW, like subroutines.
*
* \note At least one state (e.g. 'Stop') of the state transition table must be predefined in the STT.
*
* \note The CSG and/or SAR should be enabled in the first state of the STT to ensure proper working of the AC.
*
* Here is an example of a simple program coded by STT instructions.
* \snippet hppass_ac_toggle_gpio/main.c SNIPPET_HPPASS_AC_STT_CONFIG
*
* \section group_hppass_ac_startup Startup
* Startup is initiated by enabling the AC with loaded AC startup sequence instructions (cy_stc_hppass_ac_t::startup).
* The startup block have dedicated logic to time the HPPASS startup and will generate BLOCK_READY condition once
* HPPASS startup is done. The application should wait for the BLOCK_READY condition before using any HPPASS features.
* The BLOCK_READY condition can be checked by \ref Cy_HPPASS_AC_IsBlockReady function.
*
* \note Only usage of the startup parameters recommended by the vendor guarantees the reliable work of the autonomous
* controller.<br>
* Please use the <b>Device Configurator</b> tool to make configurations or refer to the <b>Technical Reference Manual</b>
* chapter <b>27.2.1.1</b> for detailed information.
*
* \section group_hppass_ac_code_snippets Code Snippets
*
* \subsection group_hppass_ac_gpio_toggle Snippet 1: GPIO Toggling by Autonomous Controller
*
* An example is shown below, describes a simple case of usage Autonomous
* Controller for toggling GPIO Out:
*
* - Configure GPIO pin P7_0 and set HSIOM mode as P7_0_PASS_MCPASS_DOUT0:
* \snippet hppass_ac_toggle_gpio/main.c SNIPPET_HPPASS_AC_GPIO_CONFIG
*
* - Configure \ref cy_stc_hppass_ac_stt_t structure array with appropriate
* configurations for each state of Autonomous Controller:
* \snippet hppass_ac_toggle_gpio/main.c SNIPPET_HPPASS_AC_STT_CONFIG
*
* - Set HPPASS and AC state transition table configuration, used by
* \ref Cy_HPPASS_Init API:
* \snippet hppass_ac_toggle_gpio/main.c SNIPPET_HPPASS_CONFIG
*
* - Initialize and start Autonomous Controller:
* \snippet hppass_ac_toggle_gpio/main.c SNIPPET_HPPASS_AC_INIT
* \snippet hppass_ac_toggle_gpio/main.c SNIPPET_HPPASS_AC_START
*
*
* \subsection group_hppass_input_trigger Snippet 2: The AC state triggering by FW and HW input triggers
*
* The below example is a simple case of using HPPASS input
* trigger events to trigger the Autonomous Controller state. The code snippet shows
* two approaches: FW trigger and HW trigger configurations.
*
* - Configure the \ref cy_stc_hppass_ac_stt_t structure array, where the
* Autonomous Controller in state #0 waits for a trigger to change that state:
* \snippet hppass_trigger/main.c SNIPPET_HPPASS_TRIGGER_AC_STT_CONFIG
*
* <b>Initialization of the hardware modules for the AC with input triggers:</b>
* \snippet hppass_trigger/main.c SNIPPET_HPPASS_INIT_SECTION
*
* <b>Triggering HPPASS Autonomous Controller state by FW trigger:</b>
* \snippet hppass_trigger/main.c SNIPPET_HPPASS_TRIGGER_FW_TRIGGER_TEST
*
* <b>Triggering HPPASS Autonomous Controller state by HW trigger:</b>
* \snippet hppass_trigger/main.c SNIPPET_HPPASS_TRIGGER_HW_TRIGGER_TEST
*
* \defgroup group_hppass_ac_macros Macros
* \{
*   \defgroup group_hppass_ac_dout GPIO Out Masks
*   \defgroup group_hppass_ac_seq_grp SAR Sequencer Groups mask.
* \}
* \defgroup group_hppass_ac_functions Functions
* \defgroup group_hppass_ac_data_structures Data Structures
* \defgroup group_hppass_ac_enums Enumerated Types
* \} */

#if !defined(CY_HPPASS_AC_H)
#define CY_HPPASS_AC_H

