RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_ac.h
#include "cy_device.h"

#ifdef CY_IP_MXS40MCPASS

#include <stdint.h>
#include <stdbool.h>
#include <stddef.h>
#include "cy_syslib.h"

#if defined(__cplusplus)
extern "C" {
#endif

/** \addtogroup group_hppass_macros
* \{
*/

/** Driver major version */
#define CY_HPPASS_DRV_VERSION_MAJOR 1

/** Driver minor version */
#define CY_HPPASS_DRV_VERSION_MINOR 30

/** The driver identifier for the High Performance Programmable Analog Sub-System */
#define CY_HPPASS_ID                CY_PDL_DRV_ID(0x77UL)

/** The number of startup configurations */
#define CY_HPPASS_STARTUP_CFG_NUM   (4U)

/** The AC Timer Table size */
#define CY_HPPASS_AC_STT_SIZE       (16U)

/** The number of CSG slices */
#define CY_HPPASS_CSG_NUM           (5UL)

/** The number of the sampler muxes */
#define CY_HPPASS_SAR_MUX_NUM       (4U)

/** \} group_hppass_macros */

/** \cond Internal macros */
/* Mask validation macros */
#define CY_HPPASS_MASK_VALID(value, mask)  (0UL == ((value) & ~(mask)))

/* BOOL to UINT conversion macros */
#define CY_HPPASS_BOOL_TO_UINT(value)  ((value) ? 1UL : 0UL)
/** \endcond */


/**
* \addtogroup group_hppass_ac_macros
* \{
*/

#define CY_HPPASS_TC_NUM            (2U) /**< The number of Timer/Counters */

/** \} group_hppass_ac_macros */

/**
* \addtogroup group_hppass_ac_dout
* \{
*/
#define CY_HPPASS_GPIO_OUT_0        (0x01U) /**< The GPIO out0 mask. */
#define CY_HPPASS_GPIO_OUT_1        (0x02U) /**< The GPIO out1 mask. */
#define CY_HPPASS_GPIO_OUT_2        (0x04U) /**< The GPIO out2 mask. */
#define CY_HPPASS_GPIO_OUT_3        (0x08U) /**< The GPIO out3 mask. */
#define CY_HPPASS_GPIO_OUT_4        (0x10U) /**< The GPIO out4 mask. */
/** \} group_hppass_ac_dout */

/**
* \addtogroup group_hppass_ac_seq_grp
* \{
*/
#define CY_HPPASS_SEQ_GRP_0_TRIG    (0x01U) /**< The SAR Sequencer Group 0 trigger mask. */
#define CY_HPPASS_SEQ_GRP_1_TRIG    (0x02U) /**< The SAR Sequencer Group 1 trigger mask. */
#define CY_HPPASS_SEQ_GRP_2_TRIG    (0x04U) /**< The SAR Sequencer Group 2 trigger mask. */
#define CY_HPPASS_SEQ_GRP_3_TRIG    (0x08U) /**< The SAR Sequencer Group 3 trigger mask. */
#define CY_HPPASS_SEQ_GRP_4_TRIG    (0x10U) /**< The SAR Sequencer Group 4 trigger mask. */
#define CY_HPPASS_SEQ_GRP_5_TRIG    (0x20U) /**< The SAR Sequencer Group 5 trigger mask. */
#define CY_HPPASS_SEQ_GRP_6_TRIG    (0x40U) /**< The SAR Sequencer Group 6 trigger mask. */
#define CY_HPPASS_SEQ_GRP_7_TRIG    (0x80U) /**< The SAR Sequencer Group 7 trigger mask. */
/** \} group_hppass_ac_seq_grp */



/** \cond Macros for conditions used by CY_ASSERT calls */
#define CY_HPPASS_DIVSTCLK_VALID(divStClk)          ((256U >= (divStClk)) && (0U < (divStClk)))
#define CY_HPPASS_ACGPIOOUTEN_VALID(acGpioOutEn)    (0U == ((acGpioOutEn) & ((uint8_t) ~(CY_HPPASS_GPIO_OUT_0 | \
                                                                                         CY_HPPASS_GPIO_OUT_1 | \
                                                                                         CY_HPPASS_GPIO_OUT_2 | \
                                                                                         CY_HPPASS_GPIO_OUT_3 | \
                                                                                         CY_HPPASS_GPIO_OUT_4))))

#define CY_HPPASS_GPIOOUT_VALID(gpioOutMsk)         (0U == ((gpioOutMsk) & ((uint8_t) ~(CY_HPPASS_GPIO_OUT_0 | \
                                                                                        CY_HPPASS_GPIO_OUT_1 | \
                                                                                        CY_HPPASS_GPIO_OUT_2 | \
                                                                                        CY_HPPASS_GPIO_OUT_3 | \
                                                                                        CY_HPPASS_GPIO_OUT_4))))

#define CY_HPPASS_BRANCHSTATE_VALID(branchState)    (15U >= (branchState))
#define CY_HPPASS_AC_COUNT_VALID(count)             ((4096U >= (count)) && (0U < (count)))

#define CY_HPPASS_AC_CONDITION_VALID(condition)     ((CY_HPPASS_CONDITION_FALSE               == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRUE                == (condition)) || \
                                                     (CY_HPPASS_CONDITION_BLOCK_READY         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CNT_DONE            == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_0_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_1_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_2_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_3_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_4_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_5_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_6_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_GROUP_7_DONE    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_0         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_1         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_2         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_3         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_4         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_5         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_6         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_LIMIT_7         == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_BUSY            == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_FIR_0_DONE      == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_FIR_1_DONE      == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_QUEUE_HI_EMPTY  == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_QUEUE_LO_EMPTY  == (condition)) || \
                                                     (CY_HPPASS_CONDITION_SAR_QUEUES_EMPTY    == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_0              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_1              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_2              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_3              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_4              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_5              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_6              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_TRIG_7              == (condition)) || \
                                                     (CY_HPPASS_CONDITION_FIFO_0_LEVEL        == (condition)) || \
                                                     (CY_HPPASS_CONDITION_FIFO_1_LEVEL        == (condition)) || \
                                                     (CY_HPPASS_CONDITION_FIFO_2_LEVEL        == (condition)) || \
                                                     (CY_HPPASS_CONDITION_FIFO_3_LEVEL        == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_0_DAC_DONE      == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_1_DAC_DONE      == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_2_DAC_DONE      == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_3_DAC_DONE      == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_4_DAC_DONE      == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_0_COMP          == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_1_COMP          == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_2_COMP          == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_3_COMP          == (condition)) || \
                                                     (CY_HPPASS_CONDITION_CSG_4_COMP          == (condition)))

