RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_ac.h
#define CY_HPPASS_AC_ACTION_VALID(action)           ((CY_HPPASS_ACTION_STOP            == (action)) || \
                                                     (CY_HPPASS_ACTION_NEXT            == (action)) || \
                                                     (CY_HPPASS_ACTION_WAIT_FOR        == (action)) || \
                                                     (CY_HPPASS_ACTION_BRANCH_IF_TRUE  == (action)) || \
                                                     (CY_HPPASS_ACTION_BRANCH_IF_FALSE == (action)))

#define CY_HPPASS_MUXSELECT_VALID(select)           (3U >= (select))
/** \endcond */

/***************************************
*       Enumerated Types
***************************************/

/** \addtogroup group_hppass_enums
* \{
*/

/** Return status for functions of the driver for High Performance Programmable Analog Sub-System */
typedef enum
{
    CY_HPPASS_SUCCESS           = CY_RSLT_SUCCESS,
    CY_HPPASS_BAD_PARAM         = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x000UL), /**< Input parameter is out of range or
                                                                                                                  *   input pointer is NULL
                                                                                                                  *   and initialization could not be completed
                                                                                                                  */
    CY_HPPASS_AC_BAD_PARAM      = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x001UL), /**< AC subsystem error */
    CY_HPPASS_AC_INVALID_STATE  = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x101UL), /**< AC invalid state */
    CY_HPPASS_CSG_BAD_PARAM     = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x002UL), /**< CSG subsystem error */
    CY_HPPASS_CSG_INVALID_STATE = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x102UL), /**< CSG invalid state */
    CY_HPPASS_SAR_BAD_PARAM     = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x004UL), /**< SAR subsystem error */
    CY_HPPASS_SAR_INVALID_STATE = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x104UL), /**< SAR invalid state */
    CY_HPPASS_TRIM_ERROR        = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x010UL), /**< Trimming error */
    CY_HPPASS_VDDA_FAIL         = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x020UL), /**< VDDA is out of range */
    CY_HPPASS_TIMEOUT           = CY_RSLT_CREATE(CY_RSLT_TYPE_ERROR, CY_RSLT_GET_MODULE(CY_HPPASS_ID), 0x040UL)  /**< Startup Timeout */
} cy_en_hppass_status_t;

/** \} group_hppass_enums */

/**
* \addtogroup group_hppass_ac_enums
* \{
*/


/**
* The Condition field in the State Transition Table,
* see \ref cy_stc_hppass_ac_stt_t.
*/
typedef enum
{
    CY_HPPASS_CONDITION_FALSE              = 0U,  /**< Hardcoded FALSE value. */
    CY_HPPASS_CONDITION_TRUE               = 1U,  /**< Hardcoded TRUE value. */
    CY_HPPASS_CONDITION_BLOCK_READY        = 2U,  /**< Enabled SAR, CSG block(s) are ready for use.
                                                   *   When this option is used in conjunction with
                                                   *   ACTION = CY_HPPASS_ACTION_WAIT_FOR, AC will stay
                                                   *   in current state, until enabled block(s) are ready for use,
                                                   *   and then go to the next state.
                                                   */
    CY_HPPASS_CONDITION_CNT_DONE           = 3U,  /**< Runout for an interval timer if the ACTION is WAIT_FOR or
                                                   *   runout for a loop counter, if the ACTION is BRANCH IF.
                                                   */
    CY_HPPASS_CONDITION_SAR_GROUP_0_DONE   = 4U,  /**< SAR Sequencer Group 0 DONE. */
    CY_HPPASS_CONDITION_SAR_GROUP_1_DONE   = 5U,  /**< SAR Sequencer Group 1 DONE. */
    CY_HPPASS_CONDITION_SAR_GROUP_2_DONE   = 6U,  /**< SAR Sequencer Group 2 DONE. */
    CY_HPPASS_CONDITION_SAR_GROUP_3_DONE   = 7U,  /**< SAR Sequencer Group 3 DONE. */
    CY_HPPASS_CONDITION_SAR_GROUP_4_DONE   = 8U,  /**< SAR Sequencer Group 4 DONE. */
    CY_HPPASS_CONDITION_SAR_GROUP_5_DONE   = 9U,  /**< SAR Sequencer Group 5 DONE. */
    CY_HPPASS_CONDITION_SAR_GROUP_6_DONE   = 10U, /**< SAR Sequencer Group 6 DONE. */
    CY_HPPASS_CONDITION_SAR_GROUP_7_DONE   = 11U, /**< SAR Sequencer Group 7 DONE. */
    CY_HPPASS_CONDITION_SAR_LIMIT_0        = 12U, /**< SAR Limit Crossing Detector 0. */
    CY_HPPASS_CONDITION_SAR_LIMIT_1        = 13U, /**< SAR Limit Crossing Detector 1. */
    CY_HPPASS_CONDITION_SAR_LIMIT_2        = 14U, /**< SAR Limit Crossing Detector 2. */
    CY_HPPASS_CONDITION_SAR_LIMIT_3        = 15U, /**< SAR Limit Crossing Detector 3. */
    CY_HPPASS_CONDITION_SAR_LIMIT_4        = 16U, /**< SAR Limit Crossing Detector 4. */
    CY_HPPASS_CONDITION_SAR_LIMIT_5        = 17U, /**< SAR Limit Crossing Detector 5. */
    CY_HPPASS_CONDITION_SAR_LIMIT_6        = 18U, /**< SAR Limit Crossing Detector 6. */
    CY_HPPASS_CONDITION_SAR_LIMIT_7        = 19U, /**< SAR Limit Crossing Detector 7. */
    CY_HPPASS_CONDITION_SAR_BUSY           = 20U, /**< SAR Busy status. */
    CY_HPPASS_CONDITION_SAR_FIR_0_DONE     = 21U, /**< SAR FIR0 result done. */
    CY_HPPASS_CONDITION_SAR_FIR_1_DONE     = 22U, /**< SAR FIR1 result done. */
    CY_HPPASS_CONDITION_SAR_QUEUE_HI_EMPTY = 23U, /**< SAR Sequencer Hi Priority Queue is empty. */
    CY_HPPASS_CONDITION_SAR_QUEUE_LO_EMPTY = 24U, /**< SAR Sequencer Low Priority Queue is empty. */
    CY_HPPASS_CONDITION_SAR_QUEUES_EMPTY   = 25U, /**< SAR Sequencer both Queues are empty. */
    CY_HPPASS_CONDITION_TRIG_0             = 32U, /**< HW/FW Trigger 0. */
    CY_HPPASS_CONDITION_TRIG_1             = 33U, /**< HW/FW Trigger 1. */
    CY_HPPASS_CONDITION_TRIG_2             = 34U, /**< HW/FW Trigger 2. */
    CY_HPPASS_CONDITION_TRIG_3             = 35U, /**< HW/FW Trigger 3. */
    CY_HPPASS_CONDITION_TRIG_4             = 36U, /**< HW/FW Trigger 4. */
    CY_HPPASS_CONDITION_TRIG_5             = 37U, /**< HW/FW Trigger 5. */
    CY_HPPASS_CONDITION_TRIG_6             = 38U, /**< HW/FW Trigger 6. */
    CY_HPPASS_CONDITION_TRIG_7             = 39U, /**< HW/FW Trigger 7. */
    CY_HPPASS_CONDITION_FIFO_0_LEVEL       = 42U, /**< FIFO Level 0 trigger. */
    CY_HPPASS_CONDITION_FIFO_1_LEVEL       = 43U, /**< FIFO Level 1 trigger. */
    CY_HPPASS_CONDITION_FIFO_2_LEVEL       = 44U, /**< FIFO Level 2 trigger. */
    CY_HPPASS_CONDITION_FIFO_3_LEVEL       = 45U, /**< FIFO Level 3 trigger. */
    CY_HPPASS_CONDITION_CSG_0_DAC_DONE     = 48U, /**< CSG0 DAC Slope/LUT waveform Done. */
    CY_HPPASS_CONDITION_CSG_1_DAC_DONE     = 49U, /**< CSG1 Slope/LUT waveform Done. */
    CY_HPPASS_CONDITION_CSG_2_DAC_DONE     = 50U, /**< CSG2 Slope/LUT waveform Done. */
    CY_HPPASS_CONDITION_CSG_3_DAC_DONE     = 51U, /**< CSG3 Slope/LUT waveform Done. */
    CY_HPPASS_CONDITION_CSG_4_DAC_DONE     = 52U, /**< CSG4 Slope/LUT waveform Done. */
    CY_HPPASS_CONDITION_CSG_0_COMP         = 56U, /**< CSG0 Comparator Trip. */
    CY_HPPASS_CONDITION_CSG_1_COMP         = 57U, /**< CSG1 Comparator Trip. */
    CY_HPPASS_CONDITION_CSG_2_COMP         = 58U, /**< CSG2 Comparator Trip. */
    CY_HPPASS_CONDITION_CSG_3_COMP         = 59U, /**< CSG3 Comparator Trip. */
    CY_HPPASS_CONDITION_CSG_4_COMP         = 60U, /**< CSG4 Comparator Trip. */

} cy_en_hppass_condition_t;

/**
* The Action field in the State Transition Table,
* see \ref cy_stc_hppass_ac_stt_t.
*/
typedef enum
{
    CY_HPPASS_ACTION_STOP             = 0U,  /**< Stop the Autonomous Controller. */
    CY_HPPASS_ACTION_NEXT             = 1U,  /**< Proceed to the next state in the State Transition Table (default state). */
    CY_HPPASS_ACTION_WAIT_FOR         = 2U,  /**< Wait (indefinitely) for the associated CONDITION to be TRUE
                                              *   before moving to the next state, see \ref cy_en_hppass_condition_t.
                                              */
    CY_HPPASS_ACTION_BRANCH_IF_TRUE   = 3U,  /**< Check if CONDITION has occurred.
                                              *   If it has, take the indicated branch (\ref cy_stc_hppass_ac_stt_t),
                                              *   if not, proceed to the next state.
                                              */
    CY_HPPASS_ACTION_BRANCH_IF_FALSE  = 4U,  /**< Check if CONDITION has occurred.
                                              *   If it has proceed to the next state,
                                              *   if not, take the indicated branch.
                                              */
} cy_en_hppass_action_t;


/** \} group_hppass_ac_enums */

