RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_ac.h
/***************************************
*       Configuration Structures
***************************************/

/**
* \addtogroup group_hppass_ac_data_structures
* \{
*/

/** Startup configuration structure */
typedef struct
{
    uint8_t count;  /**< Count value in HPPASS clock cycles. The range is 0 to 255. Actual value is count + 1 */
    bool sar;       /**< Enable SAR startup */
    bool csgChan;   /**< Enable CSG Channel startup */
    bool csgSlice;  /**< Enable CSG Slice startup */
    bool csgReady;  /**< Enable CSG Auto Zero/Comparator gate startup */
} cy_stc_hppass_startup_t;


/** The Autonomous Controller itself state */
typedef struct
{
    bool running;       /**< The current status (running/stopped) of the Autonomous Controller. */
    uint8_t stateIdx;   /**< The current state of the Autonomous Controller in the State Transition Table. */
} cy_stc_hppass_state_ac_t;


/** The Timer/Counter state of the Autonomous Controller */
typedef struct
{
    uint16_t count;     /**< The current Timer/Counter value. */
    uint8_t stateIdx;   /**< The current State Transition Table state tied to this Timer/Counter. */
    bool busy;          /**< The current Timer/Counter busy/idle status. */
} cy_stc_hppass_state_tc_t;


/** The Autonomous Controller state, used in the \ref Cy_HPPASS_AC_GetState */
typedef struct
{
    cy_stc_hppass_state_ac_t ac;                    /**< The current Autonomous Controller state. */
    cy_stc_hppass_state_tc_t tc[CY_HPPASS_TC_NUM];  /**< The current Timer/Counter states. */
} cy_stc_hppass_state_t;


/**
* Analog Routing MUX control.
*/
typedef struct
{
    bool unlock;        /**< Muxed Sampler unlock to change the MUX setting by \ref cy_stc_hppass_stt_mux_t::chanIdx */
    uint8_t chanIdx;    /**< Muxed Sampler channel selection. Valid Range: 0..3.
                         *   Effective if the \ref cy_stc_hppass_stt_mux_t::unlock is true. Otherwise ignored.
                         */
} cy_stc_hppass_stt_mux_t;


/**
* Configuration structure for one row of the State Transition Table,
* array of these structures defines whole State Transition Table.
* The State Transition Table may have maximum 16 rows.
*/
typedef struct
{
    /* Autonomous Controller section of the State Transition Table state */
    cy_en_hppass_condition_t condition; /**< Condition field. */
    cy_en_hppass_action_t action;       /**< Action field. */
    uint8_t branchStateIdx;             /**< Index of the next state, used if
                                         *   cy_stc_hppass_ac_stt_t::action is
                                         *   \ref CY_HPPASS_ACTION_BRANCH_IF_TRUE or
                                         *   \ref CY_HPPASS_ACTION_BRANCH_IF_FALSE.
                                         *   The range is 0 to 15.
                                         */
    bool interrupt; /**< Send Output Pulse Trigger or generate CPU Interrupt if
                                         *   configured. If cy_stc_hppass_ac_stt_t::action is
                                         *   \ref CY_HPPASS_ACTION_WAIT_FOR, the trigger or
                                         *   interrupt is generated after the condition occurs.
                                         */
    uint16_t count; /**< Field to set the timer/counter value for an interval
                                         *   or loop counts. If cy_stc_hppass_ac_stt_t::action is
                                         *   \ref CY_HPPASS_ACTION_WAIT_FOR, the field is an
                                         *   interval timer, if \ref CY_HPPASS_ACTION_BRANCH_IF_TRUE
                                         *   or \ref CY_HPPASS_ACTION_BRANCH_IF_FALSE - the field is
                                         *   a loop counter. The range is 1 to 4096.
                                         */
    /* GPIO out */
    bool gpioOutUnlock;                 /**< GPIO Out Unlock:
                                         *   false, Lock: GPIO Out does NOT get updated
                                         *   true, Unlock: GPIO Out does get updated
                                         */
    uint8_t gpioOutMsk;                 /**< GPIO out generation, use \ref group_hppass_ac_dout masks */

    /* CSG section of the State Transition Table state */
    bool csgUnlock[CY_HPPASS_CSG_NUM];  /**< CSG Unlock:
                                         *   false, Lock: cy_stc_hppass_ac_stt_t::csgEnable is
                                         *   ignored
                                         *   true, Unlock: CSG state is set per
                                         *   cy_stc_hppass_ac_stt_t::csgEnable
                                         */
    bool csgEnable[CY_HPPASS_CSG_NUM];  /**< CSG Slice Enable.
                                         *   Must be used with the cy_stc_hppass_ac_stt_t::csgUnlock
                                         *   to enable or disable selected CSG Slice.
                                         *   Normally used in conjunction with
                                         *   cy_stc_hppass_ac_stt_t::action ==
                                         *   \ref CY_HPPASS_ACTION_WAIT_FOR and
                                         *   cy_stc_hppass_ac_stt_t::condition ==
                                         *   \ref CY_HPPASS_CONDITION_BLOCK_READY
                                         */
    bool csgDacTrig[CY_HPPASS_CSG_NUM]; /**< CSG Slice Trigger.
                                         *   When the CSG Slice is enabled, this field can be
                                         *   used as CSG DAC Start or Update trigger
                                         *   when cy_stc_hppass_dac_t::start or
                                         *   cy_stc_hppass_dac_t::update is set to
                                         *   \ref CY_HPPASS_DAC_START_AC and
                                         *   \ref CY_HPPASS_DAC_UPDATE_AC correspondingly.
                                         */
    /* SAR section of the State Transition Table state */
    bool sarUnlock;                     /**< SAR Unlock:
                                         *   false, Lock: cy_stc_hppass_ac_stt_t::sarEnable
                                         *   is ignored,
                                         *   true, Unlock: SAR state is set per
                                         *   cy_stc_hppass_ac_stt_t::sarEnable
                                         */
    bool sarEnable;                     /**< SAR Enable.
                                         *   Must be used with the cy_stc_hppass_ac_stt_t::sarUnlock
                                         *   to enable or disable selected CSG Slice.
                                         *   Normally used in conjunction with
                                         *   cy_stc_hppass_ac_stt_t::action ==
                                         *   \ref CY_HPPASS_ACTION_WAIT_FOR and
                                         *   cy_stc_hppass_ac_stt_t::condition ==
                                         *   \ref CY_HPPASS_CONDITION_BLOCK_READY
                                         */
    uint8_t sarGrpMsk;                  /**< The Sequencer Groups mask, use
                                         *  \ref group_hppass_ac_seq_grp.
                                         *   When the SAR is enabled, this field can be
                                         *   used to trigger one ore more SAR Group entries
                                         *   when cy_stc_hppass_sar_grp_t::trig is set to
                                         *   \ref CY_HPPASS_SAR_TRIG_AC.
                                         */
    cy_stc_hppass_stt_mux_t sarMux[CY_HPPASS_SAR_MUX_NUM];  /**< Array of the Muxed Sampler control settings.
                                         *   Effective only if the correspondent
                                         *   cy_stc_hppass_sar_t::muxMode ==
                                         *   \ref CY_HPPASS_SAR_MUX_AC, otherwise ignored.
                                         */
} cy_stc_hppass_ac_stt_t;


/** Configuration structure to set up the Autonomous Controller */
typedef struct
{
    uint8_t sttEntriesNum;              /**< Number of states in State Transition Table */
    const cy_stc_hppass_ac_stt_t * stt; /**< The non-NULL pointer to the array of State
                                         *   Transition Table \ref cy_stc_hppass_ac_stt_t
                                         *   items, the size is specified by the
                                         *   cy_stc_hppass_ac_t::sttEntriesNum.
                                         */
    uint8_t gpioOutEnMsk;               /**< The Autonomous Controller GPIO output enable mask */
    uint16_t startupClkDiv;             /**< Startup Clock Divider. The range is 1 to 256. */
    cy_stc_hppass_startup_t startup[CY_HPPASS_STARTUP_CFG_NUM]; /**< Startup configuration */
} cy_stc_hppass_ac_t;

/** \} group_hppass_ac_data_structures */


