RIOT-OS/RIOT/cpu/psoc6/include/vendor/include/cy_hppass_ac.h
/***************************************
*        Function Prototypes
***************************************/

/** \addtogroup group_hppass_ac_functions
*   \{ */


/*******************************************************************************
* Function Name: Cy_HPPASS_AC_UpdateStateTransitionTable
****************************************************************************//**
*
* Used for adding or replacing state into State Transition Table - useful for multiple
* applications accessing the High Performance Programmable Analog Sub-System.
*
* \param numEntries
* Number of entries of the State Transition Table for replace.
* Valid range: 1...\ref CY_HPPASS_AC_STT_SIZE.
*
* \param stateTransitionTable
* Pointer to array containing new set of configuration data for State Transition Table,
* which must be replaced or added. The pointer cannot be NULL.
*
* \param startState
* Defines state in the State Transition Table from which update of the content begins.
* Valid range: 0...\ref CY_HPPASS_AC_STT_SIZE - 1.
*
* \return
* Combined value of all the subsystem statuses, \ref cy_en_hppass_status_t.
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_AC_UpdateStateTransitionTable(uint8_t numEntries, const cy_stc_hppass_ac_stt_t * stateTransitionTable, uint8_t startState);


/*******************************************************************************
* Function Name: Cy_HPPASS_AC_LoadStateTransitionTable
****************************************************************************//**
*
* Configuring the State Transition Table of the the Autonomous Controller
* according to the provided settings.
*
* \param numEntries
* Number of entries in the State Transition Table.
* Valid range: 1...\ref CY_HPPASS_AC_STT_SIZE.
*
* \param stateTransitionTable
* Pointer to array containing configuration data for entire State Transition Table,
* \ref cy_stc_hppass_ac_stt_t. The pointer cannot be NULL.
*
* \return
* Combined value of all the subsystem statuses, \ref cy_en_hppass_status_t.
*
*******************************************************************************/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_AC_LoadStateTransitionTable(uint8_t numEntries, const cy_stc_hppass_ac_stt_t * stateTransitionTable)
{
    return Cy_HPPASS_AC_UpdateStateTransitionTable(numEntries, stateTransitionTable, 0U);
}


/*******************************************************************************
* Function Name: Cy_HPPASS_AC_IsRunning
****************************************************************************//**
*
* Returns the running/stopped status of the Autonomous Controller.
*
* \return
* Running status: true - running, false - stopped.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_HPPASS_AC_IsRunning(void)
{
    return _FLD2BOOL(HPPASS_ACTRLR_STATUS_STATUS, HPPASS_AC_STATUS(HPPASS_BASE));
}


/*******************************************************************************
* Function Name: Cy_HPPASS_AC_Start
****************************************************************************//**
*
* Starts the Autonomous Controller from the specified STT state.
*
* \note The AC, in case of emergency hanging up,
* can be forcibly stopped by the \ref Cy_HPPASS_DeInit only.
*
* \param startState
* Starting state index in the State Transition Table.

* \param timeoutUs
* The startup timeout in microseconds.
* When non-zero - the function waits for the BLOCK_READY status and check the timeout.
* When zero - the function just triggers AC start command and returns immediately.
*
* \return
* Status of execution:
* - CY_HPPASS_SUCCESS - the AC is started successfully.
* - CY_HPPASS_AC_INVALID_STATE - the AC is already running.
* - CY_HPPASS_AC_BAD_PARAM - input parameter is invalid.
* - CY_HPPASS_VDDA_FAIL - VDDA is out of range.
* - CY_HPPASS_TIMEOUT - the timeout timer has expired before BLOCK_READY condition.
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_AC_Start(uint8_t startState, uint16_t timeoutUs);


/*******************************************************************************
* Function Name: Cy_HPPASS_AC_GetState
****************************************************************************//**
*
* Provides status of operation for the Autonomous Controller.
*
* \param state
* Pointer to structure for receiving state regarding operation conditions
* of the Autonomous Controller, \ref cy_stc_hppass_state_t.
* The pointer cannot be NULL.
*
* \return
* Status of execution, \ref cy_en_hppass_status_t.
*
*******************************************************************************/
cy_en_hppass_status_t Cy_HPPASS_AC_GetState(cy_stc_hppass_state_t * state);


/*******************************************************************************
* Function Name: Cy_HPPASS_AC_IsBlockReady
****************************************************************************//**
*
* Returns the AC block ready status.
*
* \return
* Running status: true - ready for use, false - not ready.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_HPPASS_AC_IsBlockReady(void)
{
    return _FLD2BOOL(HPPASS_ACTRLR_BLOCK_STATUS_READY, HPPASS_AC_BLOCK_STATUS(HPPASS_BASE));
}


/** \} group_hppass_ac_functions */

/** \cond
* Internal function - not to be used in the user code.
* The function suppress the Autonomous Controller state (stopped/running) check
* in case when it is called from the cy_hppass_*.c files
* to do not repeat this checks repeatedly in 'for' cycles.
*/
__STATIC_INLINE cy_en_hppass_status_t Cy_HPPASS_AC_CondRunCheck(void)
{
    #if !defined CY_HPPASS_SUPPRESS_AC_RUN_CHECK
        cy_en_hppass_status_t result = CY_HPPASS_SUCCESS;

        if (Cy_HPPASS_AC_IsRunning())
        {
            result = CY_HPPASS_AC_INVALID_STATE;
        }

        return result;
    #else
        return CY_HPPASS_SUCCESS;
    #endif
}
/** \endcond */

#if defined(__cplusplus)
}
#endif

#endif /* CY_IP_MXS40MCPASS */

#endif /** !defined(CY_HPPASS_AC_H) */

/* [] END OF FILE */
